---
kind: type
id: T:Autodesk.Revit.DB.DefinitionBindingMapIterator
source: html/54fa1065-02f7-f4e8-3440-5ec269d422f4.htm
---
# Autodesk.Revit.DB.DefinitionBindingMapIterator

An iterator to a parameter definition to parameter bindings map.

## Syntax (C#)
```csharp
public abstract class DefinitionBindingMapIterator : APIObject,
	IEnumerator
```